
// TODO: продумать как можно по другому определить зону
#Область ПроверкаВозможностиВыполненияАлгоритмов

// Проверяет, текущая база является ли боевой
//
// Возвращаемое значение:
//   Булево   - Признак, что текущая база является боевой
//
Функция ЭтоРабочаяБаза() Экспорт
	
	Если Найти(НРег(СтрокаСоединенияИнформационнойБазы()),"ref=""ib"";") = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Проверяет, текущая база является ли тестовой
//
// Возвращаемое значение:
//   Булево   - Признак, что текущая база является тестовой
//
Функция ЭтоТестоваяБаза() Экспорт
	
	Если Найти(НРег(СтрокаСоединенияИнформационнойБазы()),"ref=""test_ib"";") = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Если текущая база является боевой или тестовой то код можно выполнять без опасений
//
// Возвращаемое значение:
//   Булево   - Возможность безопасного выполнения кода
//
Функция ПроверитьВозможностьВыполнения() Экспорт
	
	Возврат КодОбщегоНазначенияКлиентСерверПовтИсп.ЭтоРабочаяБаза() Или КодОбщегоНазначенияКлиентСерверПовтИсп.ЭтоТестоваяБаза();
	
КонецФункции

#КонецОбласти